docs/docs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-30 mar 16:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Developer - Mikel Losada</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="mikel" />
<link href="https://github.com/kaushalmodi/.emacs.d/blob/master/misc/css/leuven_theme.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Python Developer - Mikel Losada</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6e6f711">1. DOCS</a>
<ul>
<li><a href="#org06e586f">1.1. Get Docker</a></li>
<li><a href="#org6296389">1.2. Running Docker as a non sudo user</a></li>
<li><a href="#org360c53e">1.3. Make commands</a>
<ul>
<li><a href="#orge180d30">1.3.1. setupmysql</a></li>
<li><a href="#org5c7fef7">1.3.2. up</a></li>
<li><a href="#orgbb9e971">1.3.3. build</a></li>
<li><a href="#org0710bcf">1.3.4. createsuperuser</a></li>
<li><a href="#org49d282e">1.3.5. loadmongo</a></li>
<li><a href="#orgd0c407a">1.3.6. loadsql</a></li>
<li><a href="#org6a24ed6">1.3.7. dumpmongo</a></li>
<li><a href="#org4edc076">1.3.8. dumpsql</a></li>
<li><a href="#orgfa5c10f">1.3.9. dumpsqltojson</a></li>
</ul>
</li>
<li><a href="#orgdad9c63">1.4. MongoDB</a></li>
<li><a href="#orgec54652">1.5. MariaDB</a></li>
<li><a href="#org0525db1">1.6. FAQ</a>
<ul>
<li><a href="#org896851a">1.6.1. What tool did you use to create this documentation?</a></li>
<li><a href="#orgdb63476">1.6.2. How do you generate HTML on Org Mode?</a></li>
<li><a href="#orgd5f8ad5">1.6.3. How did you set up this project?</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6e6f711" class="outline-2">
<h2 id="org6e6f711"><span class="section-number-2">1</span> DOCS</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org06e586f" class="outline-3">
<h3 id="org06e586f"><span class="section-number-3">1.1</span> Get Docker</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://docs.docker.com/engine/install/">https://docs.docker.com/engine/install/</a>
</p>
</div>
</div>

<div id="outline-container-org6296389" class="outline-3">
<h3 id="org6296389"><span class="section-number-3">1.2</span> Running Docker as a non sudo user</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://docs.docker.com/engine/install/linux-postinstall/">https://docs.docker.com/engine/install/linux-postinstall/</a>
</p>
</div>
</div>

<div id="outline-container-org360c53e" class="outline-3">
<h3 id="org360c53e"><span class="section-number-3">1.3</span> Make commands</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orge180d30" class="outline-4">
<h4 id="orge180d30"><span class="section-number-4">1.3.1</span> setupmysql</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Creates the python_developer SQL database.
</p>

<p>
Creates the mikel user with password 'mikel' and grants it all privileges, flushing them afterwards.
</p>

<p>
<b>You will need to run this command after you do a fresh build.</b>
</p>
</div>
</div>
<div id="outline-container-org5c7fef7" class="outline-4">
<h4 id="org5c7fef7"><span class="section-number-4">1.3.2</span> up</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Runs Django, MariaDB and MongoDB containers.
</p>

<p>
Access Django at 
</p>
<pre class="example">
0.0.0.0:8000 
</pre>
</div>
</div>
<div id="outline-container-orgbb9e971" class="outline-4">
<h4 id="orgbb9e971"><span class="section-number-4">1.3.3</span> build</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Builds Django, MariaDB and MongoDB containers.
</p>
</div>
</div>
<div id="outline-container-org0710bcf" class="outline-4">
<h4 id="org0710bcf"><span class="section-number-4">1.3.4</span> createsuperuser</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
Creates a Django superuser.
</p>

<p>
Run this once to create a superuser and access the admin site at 
</p>
<pre class="example">
0.0.0.0:8000/admin
</pre>
</div>
</div>
<div id="outline-container-org49d282e" class="outline-4">
<h4 id="org49d282e"><span class="section-number-4">1.3.5</span> loadmongo</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
Creates a Mongo collection in the python_developer_db database.
</p>

<p>
<b>segments_input.json</b> and <b>restaurants_input.json</b> must be in the root folder.
</p>
</div>
</div>
<div id="outline-container-orgd0c407a" class="outline-4">
<h4 id="orgd0c407a"><span class="section-number-4">1.3.6</span> loadsql</h4>
<div class="outline-text-4" id="text-1-3-6">
<p>
Populates the python_developer MySQL database.
</p>

<p>
<b>segments_input.json</b> and <b>restaurants_input.json</b> must be in the root folder.
</p>
</div>
</div>
<div id="outline-container-org6a24ed6" class="outline-4">
<h4 id="org6a24ed6"><span class="section-number-4">1.3.7</span> dumpmongo</h4>
<div class="outline-text-4" id="text-1-3-7">
<p>
Creates a dump of the python_developer_db Mongo database using mongodump. 
</p>

<p>
This dump is gzip-compressed.
</p>
</div>
</div>
<div id="outline-container-org4edc076" class="outline-4">
<h4 id="org4edc076"><span class="section-number-4">1.3.8</span> dumpsql</h4>
<div class="outline-text-4" id="text-1-3-8">
<p>
Creates a dump of the python_developer MySQL database using mysqldump. 
</p>

<p>
This dump is in SQL format.
</p>
</div>
</div>
<div id="outline-container-orgfa5c10f" class="outline-4">
<h4 id="orgfa5c10f"><span class="section-number-4">1.3.9</span> dumpsqltojson</h4>
<div class="outline-text-4" id="text-1-3-9">
<p>
Creates a dump of the python_developer MySQL database using the dumpsqltojson custom django-admin command.
</p>

<p>
This dump is in JSON format.
</p>
</div>
</div>
</div>

<div id="outline-container-orgdad9c63" class="outline-3">
<h3 id="orgdad9c63"><span class="section-number-3">1.4</span> MongoDB</h3>
</div>

<div id="outline-container-orgec54652" class="outline-3">
<h3 id="orgec54652"><span class="section-number-3">1.5</span> MariaDB</h3>
</div>

<div id="outline-container-org0525db1" class="outline-3">
<h3 id="org0525db1"><span class="section-number-3">1.6</span> FAQ</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org896851a" class="outline-4">
<h4 id="org896851a"><span class="section-number-4">1.6.1</span> What tool did you use to create this documentation?</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Emacs and org-mode, with the <a href="https://fniessen.github.io/org-html-themes/setup/theme-bigblow.setup">Big Blow theme</a>. The source is docs.org (in this folder).
</p>
</div>
</div>

<div id="outline-container-orgdb63476" class="outline-4">
<h4 id="orgdb63476"><span class="section-number-4">1.6.2</span> How do you generate HTML on Org Mode?</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
<a href="https://orgmode.org/manual/HTML-export-commands.html#HTML-export-commands">By pressing C-c C-e h-h</a>.
</p>
</div>
</div>

<div id="outline-container-orgd5f8ad5" class="outline-4">
<h4 id="orgd5f8ad5"><span class="section-number-4">1.6.3</span> How did you set up this project?</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
<a href="https://github.com/pydanny/cookiecutter-django">I used Django Cookiecutter</a>.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: mikel</p>
<p class="date">Created: 2020-06-30 mar 16:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
